IDEA StatiCa Open Model
BeamDataEc2.TypeOfCalculation Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 there are several types of calculation
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public TypeOfCalculationDeflection TypeOfCalculation { get; set; }
Public Property TypeOfCalculation As TypeOfCalculationDeflection
	Get
	Set
public:
property TypeOfCalculationDeflection TypeOfCalculation {
	TypeOfCalculationDeflection get ();
	void set (TypeOfCalculationDeflection value);
}
Property Value
Type: TypeOfCalculationDeflection
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace